export const questions = [
  {
    id: 1,
    question: "새로운 사람들과 어울릴 때, 당신은?",
    options: ["에너지가 넘치고 즐겁다.", "에너지가 소모되는 느낌이다."],
    type: "E/I",
  },
  {
    id: 2,
    question: "친구와 밥을 먹기로 했을 때, 당신은?",
    options: ["미리 맛집 리스트를 찾아본다.", "친구와 만나서 식당을 정한다."],
    type: "J/P",
  },
  {
    id: 3,
    question: "중요한 결정을 내릴 때, 당신은?",
    options: [
      "주변 사람들과 이야기하며 의견을 나눈다.",
      "혼자 깊이 생각한 후 결정을 내린다.",
    ],
    type: "E/I",
  },
  {
    id: 4,
    question: "문제를 해결할 때. 당신은?",
    options: [
      "검증된 방법이나 이전에 효과가 있었던 방식을 따른다.",
      "창의적인 아이디어나 색다른 접근법을 시도한다.",
    ],
    type: "S/N",
  },
  {
    id: 5,
    question: "주말에 시간을 보낼 때, 당신은?",
    options: ["친구들과 만나거나 활동적인 일을 한다.", "혼자서 시간을 보낸다"],
    type: "E/I",
  },
  {
    id: 6,
    question: "비행기를 탔을 때, 당신은",
    options: [
      "비행기 타는 것을 기대한다.",
      "비행기가 추락해서 무인도에 표류하는 것을 떠올린다.",
    ],
    type: "S/N",
  },
  {
    id: 7,
    question: "갑자기 친구가 나오라고 할 때, 당신은?",
    options: ["예정에 없던 계획이라 당황해한다.", "큰 고민 없이 바로 나간다."],
    type: "J/P",
  },
  {
    id: 8,
    question: "죽음에 대해 생각할 때, 당신은?",
    options: ["죽으면 그냥 죽는 것이다", "죽어서 귀신이 되는 상상을 한다."],
    type: "S/N",
  },
  {
    id: 9,
    question: "업무 처리를 할 때, 당신은?",
    options: [
      "일정대로 업무를 처리하는 편이다.",
      "마감 직전에 집중해서 끝내는 편이다.",
    ],
    type: "J/P",
  },
  {
    id: 10,
    question: "친구가 고민을 털어놓을 때, 당신은?",
    options: [
      "문제의 원인을 분석하고 해결책을 제안한다.",
      "친구에게 공감하며 위로를 건넨다.",
    ],
    type: "T/F",
  },
  {
    id: 11,
    question: "친구가 꿈에 대해 이야기할 때, 당신은?",
    options: [
      "현실적인 계획과 실현 가능성을 먼저 생각한다.",
      "미래에 대해 상상하며 함께 이야기한다.",
    ],
    type: "S/N",
  },
  {
    id: 12,
    question: "친구가 지각을 했는데 사과를 안할 때, 당신은?",
    options: [
      "지각한 이유가 타당하다면 괜찮다.",
      "지각을 했는데 왜 사과를 안하지?",
    ],
    type: "T/F",
  },
  {
    id: 13,
    question: "새로운 개념을 배울 때. 당신은?",
    options: [
      "실제 사례나 경험을 통해 배운다.",
      "이론과 개념을 먼저 이해하고 전체적인 흐름을 본다.",
    ],
    type: "S/N",
  },
  {
    id: 14,
    question: "친구가 차 사고가 났다고 말했을 때, 당신은?",
    options: [
      "보험에 들었냐고 먼저 물어본다",
      "다친 곳은 없냐고 먼저 물어본다",
    ],
    type: "T/F",
  },
  {
    id: 15,
    question: "하루 일과를 마쳤을 때, 당신은?",
    options: [
      "주변 사람들과 시간을 보내며 스트레스를 푼다.",
      "혼자만의 시간을 즐긴다.",
    ],
    type: "E/I",
  },
  {
    id: 16,
    question: "친구와 슬픔을 나눌 때, 당신은?",
    options: ["슬픈 사람이 둘이 된다.", "슬픔이 반이 된다."],
    type: "T/F",
  },
  {
    id: 17,
    question: "새로운 환경에 있을 때, 당신은?",
    options: [
      "먼저 말을 걸고 적극적으로 교류한다.",
      "주변 상황을 먼저 파악한다.",
    ],
    type: "E/I",
  },
  {
    id: 18,
    question: "하루 일정을 계획할 때, 당신은?",
    options: [
      "미리 계획을 세우고 그에 맞춰 움직인다.",
      "유동적으로 움직이며 상황에 맞춰 조정한다.",
    ],
    type: "J/P",
  },
  {
    id: 19,
    question: "친구가 당신이 너무 좋다고 할 때, 당신은?",
    options: ["나를 왜 좋아해주지?", "나를 좋아해주다니 감동이다."],
    type: "T/F",
  },
  {
    id: 20,
    question: "한 달 뒤에 제주도 여행을 가게 되었을 때, 당신은?",
    options: ["미리 계획을 짜둔다", "여행은 즉흥적인게 최고다"],
    type: "J/P",
  },
];
